Repository: Sampel65/Progressa
Catalog: task/Resources/Localizable.xcstrings
Source language: en
Languages: es, fr

source: %lld of %lld lessons
es: %1$lld de %2$lld lecciones
fr: %1$lld sur %2$lld leçons

source: Account Created!
es: ¡Cuenta creada!
fr: Compte créé !

source: Achievement Unlocked!
es: ¡Logro desbloqueado!
fr: Succès débloqué !

source: Active learning path
es: Ruta de aprendizaje activa
fr: Parcours d'apprentissage actif

source: All
es: Todos
fr: Tous

source: Already completed
es: Ya completado
fr: Déjà terminé

source: Already have an account?
es: ¿Ya tienes una cuenta?
fr: Vous avez déjà un compte ?

source: Amazing streak! You're on fire! 🔥
es: ¡Racha increíble! ¡Estás en racha! 🔥
fr: Série incroyable ! Vous êtes en feu ! 🔥

source: An account with this email already exists.
es: Ya existe una cuenta con este correo.
fr: Un compte avec cette adresse e-mail existe déjà.

source: Awards
es: Premios
fr: Récompenses

source: badge
es: insignia

source: badges
es: insignias

source: Badges
es: Insignias

source: Complete the "%1$@" to earn this
es: Completa "%1$@" para obtenerlo
fr: Complétez « %1$@ » pour l'obtenir

source: Completed
es: Completado
fr: Terminé

source: Confirm password
es: Confirmar contraseña
fr: Confirmer le mot de passe

source: Continue
es: Continuar
fr: Continuer

source: Continue making progress on your learning path
es: Sigue avanzando en tu ruta de aprendizaje
fr: Poursuivez vos progrès sur votre parcours

source: Create Account
es: Crear cuenta
fr: Créer un compte

source: day
es: día
fr: jour

source: Day Streak
es: Racha de días
fr: Série de jours

source: days
es: días
fr: jours

source: Don't have an account?
es: ¿No tienes una cuenta?
fr: Vous n'avez pas de compte ?

source: Earned
es: Obtenidos
fr: Obtenus

source: Email address
es: Correo electrónico
fr: Adresse e-mail

source: Fair
es: Aceptable
fr: Correct

source: For today
es: Para hoy
fr: Pour aujourd'hui

source: Full name
es: Nombre completo
fr: Nom complet

source: Get Started
es: Comenzar
fr: Commencer

source: Good
es: Bueno
fr: Bon

source: Good afternoon
es: Buenas tardes
fr: Bon après-midi

source: Good evening
es: Buenas noches
fr: Bonsoir

source: Good morning
es: Buenos días
fr: Bonjour

source: Good night
es: Buenas noches
fr: Bonne nuit

source: Great momentum! Keep it going! 💪
es: ¡Buen ritmo! ¡Sigue así! 💪
fr: Belle dynamique ! Continuez ! 💪

source: Great progress! Almost halfway there.
es: ¡Buen progreso! Casi a la mitad.
fr: Beau progrès ! Bientôt à mi-chemin.

source: Great work! Keep the momentum going.
es: ¡Buen trabajo! Mantén el ritmo.
fr: Bon travail ! Gardez le rythme.

source: Home
es: Inicio
fr: Accueil

source: I agree to the Terms of Service & Privacy Policy
es: Acepto los Términos de servicio y la Política de privacidad
fr: J'accepte les Conditions d'utilisation et la Politique de confidentialité

source: In Progress
es: En curso
fr: En cours

source: Invalid email or password.
es: Correo o contraseña incorrectos.
fr: Adresse e-mail ou mot de passe incorrect.

source: Keep Going
es: Sigue así
fr: Continuez

source: Keep your daily streak going
es: Mantén tu racha diaria
fr: Maintenez votre série quotidienne

source: Key Takeaways
es: Puntos clave
fr: Points clés

source: Learn
es: Aprender
fr: Apprendre

source: Learning Progress
es: Progreso de aprendizaje
fr: Progression d'apprentissage

source: Lesson Complete!
es: ¡Lección completada!
fr: Leçon terminée !

source: Lesson Overview
es: Resumen de la lección
fr: Aperçu de la leçon

source: Lessons
es: Lecciones
fr: Leçons

source: Let's start learning
es: Empecemos a aprender
fr: Commençons à apprendre

source: Let's start your learning journey! 🎯
es: ¡Comencemos tu aprendizaje! 🎯
fr: Commençons votre apprentissage ! 🎯

source: Loading awards...
es: Cargando premios...
fr: Chargement des récompenses...

source: Loading learning path...
es: Cargando ruta de aprendizaje...
fr: Chargement du parcours...

source: Mark as Complete
es: Marcar como completado
fr: Marquer comme terminé

source: Mastery
es: Dominio
fr: Maîtrise

source: Milestone
es: Hito
fr: Jalon

source: Name must be at least 2 characters.
es: El nombre debe tener al menos 2 caracteres.
fr: Le nom doit contenir au moins 2 caractères.

source: Over halfway there! You've got this! 🚀
es: ¡Más de la mitad! ¡Tú puedes! 🚀
fr: Plus de la moitié ! Vous y êtes ! 🚀

source: Over halfway! Your collection is growing.
es: ¡Más de la mitad! Tu colección crece.
fr: Plus de la moitié ! Votre collection s'agrandit.

source: Password
es: Contraseña
fr: Mot de passe

source: Password (min 8 characters)
es: Contraseña (mín. 8 caracteres)
fr: Mot de passe (8 caractères min.)

source: Password must be at least 8 characters.
es: La contraseña debe tener al menos 8 caracteres.
fr: Le mot de passe doit contenir au moins 8 caractères.

source: Passwords do not match.
es: Las contraseñas no coinciden.
fr: Les mots de passe ne correspondent pas.

source: Please enter a valid email address.
es: Introduce una dirección de correo válida.
fr: Veuillez entrer une adresse e-mail valide.

source: Push yourself further to unlock this reward
es: Esfuérzate más para desbloquear esta recompensa
fr: Dépassez-vous pour débloquer cette récompense

source: remaining
es: restantes
fr: restants

source: Share Achievement
es: Compartir logro
fr: Partager le succès

source: Sign In
es: Iniciar sesión
fr: Se connecter

source: Sign in to continue your learning journey
es: Inicia sesión para continuar aprendiendo
fr: Connectez-vous pour poursuivre votre apprentissage

source: Sign Out
es: Cerrar sesión
fr: Se déconnecter

source: Sign Up
es: Registrarse
fr: S'inscrire

source: So close to collecting them all!
es: ¡Casi los tienes todos!
fr: Plus qu'un pour tous les avoir !

source: Something went wrong. Please try again.
es: Algo salió mal. Inténtalo de nuevo.
fr: Une erreur s'est produite. Veuillez réessayer.

source: Special
es: Especial
fr: Spécial

source: Stage %lld
es: Etapa %lld
fr: Étape %lld

source: Stage %lld of %lld
es: Etapa %1$lld de %2$lld
fr: Étape %1$lld sur %2$lld

source: Stages
es: Etapas
fr: Étapes

source: Start learning to earn your first badge!
es: ¡Empieza a aprender para tu primera insignia!
fr: Commencez à apprendre pour gagner votre premier badge !

source: Start your learning journey today
es: Comienza tu aprendizaje hoy
fr: Commencez votre apprentissage aujourd'hui

source: Streak
es: Racha
fr: Série

source: Strong
es: Fuerte
fr: Fort

source: to earn this
es: para obtenerlo
fr: pour l'obtenir

source: Track your journey, earn badges, and master new skills every day.
es: Sigue tu progreso, gana insignias y domina nuevas habilidades cada día.
fr: Suivez votre parcours, gagnez des badges et maîtrisez de nouvelles compétences chaque jour.

source: View full path
es: Ver ruta completa
fr: Voir le parcours complet

source: Weak
es: Débil
fr: Faible

source: Welcome Back
es: Bienvenido de nuevo
fr: Bon retour

source: Welcome back!
es: ¡Bienvenido de nuevo!
fr: Bon retour !

source: You're closer than you think 💪
es: Estás más cerca de lo que crees 💪
fr: Vous êtes plus proche que vous ne pensez 💪

source: You're just getting started — keep it up!
es: ¡Acabas de empezar — sigue así!
fr: Vous venez de commencer — continuez !

source: You've earned every badge. Legend!
es: ¡Tienes todas las insignias! ¡Leyenda!
fr: Vous avez tous les badges. Légendaire !

source: Your learning journey milestones
es: Hitos de tu aprendizaje
fr: Les jalons de votre apprentissage

source: Fullstack mobile engineer path
es: Ruta de ingeniero móvil fullstack
fr: Parcours d'ingénieur mobile fullstack

source: Master fullstack mobile development from fundamentals to deployment
es: Domina el desarrollo móvil fullstack desde los fundamentos hasta el despliegue
fr: Maîtrisez le développement mobile fullstack des fondamentaux au déploiement

source: Programming Basics
es: Fundamentos de programación
fr: Bases de la programmation

source: Learn the foundation of programming
es: Aprende los fundamentos de la programación
fr: Apprenez les bases de la programmation

source: Introduction to Programming
es: Introducción a la programación
fr: Introduction à la programmation

source: Core concepts
es: Conceptos fundamentales
fr: Concepts fondamentaux

source: Variables & Data Types
es: Variables y tipos de datos
fr: Variables et types de données

source: Primitives and structures
es: Primitivos y estructuras
fr: Primitifs et structures

source: Control Flow
es: Flujo de control
fr: Flux de contrôle

source: Loops and conditionals
es: Bucles y condicionales
fr: Boucles et conditions

source: Git & Version Control
es: Git y control de versiones
fr: Git et contrôle de version

source: Master version control workflows
es: Domina los flujos de trabajo de control de versiones
fr: Maîtrisez les flux de travail de contrôle de version

source: Git Basics
es: Fundamentos de Git
fr: Bases de Git

source: Branching & Merging
es: Ramas y fusiones
fr: Branches et fusions

source: Collaboration patterns
es: Patrones de colaboración
fr: Modèles de collaboration

source: GitHub Workflows
es: Flujos de trabajo de GitHub
fr: Flux de travail GitHub

source: Pull requests and reviews
es: Pull requests y revisiones
fr: Pull requests et révisions

source: Learn React
es: Aprende React
fr: Apprendre React

source: Component lifecycle
es: Ciclo de vida del componente
fr: Cycle de vie du composant

source: React Components
es: Componentes de React
fr: Composants React

source: State & Props
es: Estado y Props
fr: État et Props

source: Build a login screen in React
es: Construye una pantalla de inicio de sesión en React
fr: Créer un écran de connexion en React

source: React Hooks
es: Hooks de React
fr: Hooks React

source: Core Mobile UI Build
es: Construcción de UI móvil básica
fr: Construction d'interface mobile de base

source: Build cross-platform mobile interfaces
es: Construye interfaces móviles multiplataforma
fr: Créer des interfaces mobiles multiplateformes

source: Mobile UI Fundamentals
es: Fundamentos de UI móvil
fr: Fondamentaux de l'interface mobile

source: Layout and styling
es: Diseño y estilos
fr: Mise en page et styles

source: Core Components
es: Componentes básicos
fr: Composants de base

source: Responsive Layouts
es: Diseños responsivos
fr: Mises en page adaptatives

source: Adaptive design patterns
es: Patrones de diseño adaptativo
fr: Modèles de conception adaptatifs

source: Access Device Features
es: Acceso a funciones del dispositivo
fr: Accéder aux fonctionnalités du appareil

source: Camera, location, and sensors
es: Cámara, ubicación y sensores
fr: Caméra, localisation et capteurs

source: Camera & Photos
es: Cámara y fotos
fr: Caméra et photos

source: Media capture APIs
es: APIs de captura de medios
fr: APIs de capture multimédia

source: Location Services
es: Servicios de ubicación
fr: Services de localisation

source: GPS and geofencing
es: GPS y geovallas
fr: GPS et géorepérage

source: Navigations and Forms
es: Navegación y formularios
fr: Navigation et formulaires

source: App navigation and user input
es: Navegación de la app y entrada del usuario
fr: Navigation de l'app et saisie utilisateur

source: Navigation Patterns
es: Patrones de navegación
fr: Modèles de navigation

source: Stack, tab, and drawer
es: Pila, pestañas y cajón
fr: Pile, onglets et tiroir

source: Forms & Validation
es: Formularios y validación
fr: Formulaires et validation

source: Input handling
es: Manejo de entrada
fr: Gestion des saisies

source: Backend Architecture
es: Arquitectura backend
fr: Architecture backend

source: Server-side design patterns
es: Patrones de diseño del lado del servidor
fr: Modèles de conception côté serveur

source: REST API Design
es: Diseño de API REST
fr: Conception d'API REST

source: Endpoints and resources
es: Endpoints y recursos
fr: Points de terminaison et ressources

source: Database Modeling
es: Modelado de bases de datos
fr: Modélisation de base de données

source: Schema design
es: Diseño de esquema
fr: Conception de schéma

source: Node.js & Express
es: Node.js y Express
fr: Node.js et Express

source: Server-side JavaScript
es: JavaScript del lado del servidor
fr: JavaScript côté serveur

source: Express.js Basics
es: Fundamentos de Express.js
fr: Bases d'Express.js

source: REST API creation
es: Creación de API REST
fr: Création d'API REST

source: Middleware & Routing
es: Middleware y enrutamiento
fr: Middleware et routage

source: Request pipeline
es: Canalización de solicitudes
fr: Pipeline de requêtes

source: Authentication & Authorization
es: Autenticación y autorización
fr: Authentification et autorisation

source: Security and access control
es: Seguridad y control de acceso
fr: Sécurité et contrôle d'accès

source: JWT & OAuth
es: JWT y OAuth
fr: JWT et OAuth

source: Token-based auth
es: Autenticación basada en tokens
fr: Authentification par jeton

source: Role-Based Access
es: Acceso basado en roles
fr: Accès basé sur les rôles

source: Permissions system
es: Sistema de permisos
fr: Système de permissions

source: Write and Run Tests
es: Escribir y ejecutar pruebas
fr: Écrire et exécuter des tests

source: Unit and integration testing
es: Pruebas unitarias e de integración
fr: Tests unitaires et d'intégration

source: Unit Testing
es: Pruebas unitarias
fr: Tests unitaires

source: Jest and testing library
es: Jest y biblioteca de pruebas
fr: Jest et bibliothèque de tests

source: E2E Testing
es: Pruebas E2E
fr: Tests E2E

source: End-to-end with Detox
es: End-to-end con Detox
fr: End-to-end avec Detox

source: Publish your App
es: Publica tu aplicación
fr: Publier votre application

source: App Store deployment
es: Despliegue en App Store
fr: Déploiement sur l'App Store

source: App Store Submission
es: Envío a App Store
fr: Soumission à l'App Store

source: Review guidelines
es: Directrices de revisión
fr: Lignes directrices de révision

source: CI/CD Pipeline
es: Pipeline CI/CD
fr: Pipeline CI/CD

source: Automated deployment
es: Despliegue automatizado
fr: Déploiement automatisé

source: Portfolio & Launch
es: Portafolio y lanzamiento
fr: Portfolio et lancement

source: Presentation and feedback
es: Presentación y retroalimentación
fr: Présentation et retour

source: Code Starter
es: Iniciador de código
fr: Démarreur de code

source: Complete Programming Basics
es: Completa Fundamentos de programación
fr: Compléter les Bases de la programmation

source: Version Pro
es: Versión Pro

source: Complete Git & Version Control
es: Completa Git y control de versiones
fr: Compléter Git et contrôle de version

source: First Steps
es: Primeros pasos
fr: Premiers pas

source: Complete your first lesson
es: Completa tu primera lección
fr: Complétez votre première leçon

source: Dedicated
es: Dedicado
fr: Dévoué

source: Maintain a 3-day learning streak
es: Mantén una racha de aprendizaje de 3 días
fr: Maintenez une série d'apprentissage de 3 jours

source: UI Artisan
es: Artesano de UI
fr: Artisan UI

source: Complete the React stage
es: Completa la etapa de React
fr: Complétez l'étape React

source: Week Warrior
es: Guerrero semanal
fr: Guerrier de la semaine

source: Maintain a 7-day learning streak
es: Mantén una racha de aprendizaje de 7 días
fr: Maintenez une série d'apprentissage de 7 jours

source: Halfway Hero
es: Héroe a mitad de camino
fr: Héros à mi-chemin

source: Complete 50% of all lessons
es: Completa el 50% de todas las lecciones
fr: Complétez 50% de toutes les leçons

source: Data Wizard
es: Mago de datos
fr: Magicien des données

source: Complete the Backend Architecture stage
es: Completa la etapa de Arquitectura backend
fr: Complétez l'étape Architecture backend

source: Speed Learner
es: Aprendiz rápido
fr: Apprenant rapide

source: Complete 8 lessons total
es: Completa 8 lecciones en total
fr: Complétez 8 leçons au total

source: Streak Legend
es: Leyenda de racha
fr: Légende de série

source: Maintain a 30-day learning streak
es: Mantén una racha de aprendizaje de 30 días
fr: Maintenez une série d'apprentissage de 30 jours

source: Architect
es: Arquitecto
fr: Architecte

source: Complete Publish your App
es: Completa Publica tu aplicación
fr: Complétez Publier votre application

source: Grand Master
es: Gran Maestro
fr: Grand Maître

source: Complete the entire learning path
es: Completa toda la ruta de aprendizaje
fr: Complétez tout le parcours d'apprentissage

source: Complete stages
es: Completa etapas
fr: Compléter les étapes

source: Stay consistent
es: Mantén la consistencia
fr: Restez constant

source: Hit key goals
es: Alcanza objetivos clave
fr: Atteignez des objectifs clés

source: In this lesson you'll explore the core concepts of %@. Through practical examples and hands-on exercises, you'll build a strong understanding of the fundamentals that underpin modern software development. By the end, you'll be able to apply these concepts confidently in real-world projects.
es: En esta lección explorarás los conceptos fundamentales de %@. A través de ejemplos prácticos y ejercicios prácticos, desarrollarás una comprensión sólida de los fundamentos que sustentan el desarrollo de software moderno. Al final, podrás aplicar estos conceptos con confianza en proyectos del mundo real.
fr: Dans cette leçon, vous explorerez les concepts fondamentaux de %@. Grâce à des exemples pratiques et des exercices pratiques, vous développerez une compréhension solide des fondamentaux qui sous-tendent le développement logiciel moderne. À la fin, vous pourrez appliquer ces concepts en toute confiance dans des projets réels.

source: Understand the fundamental principles of %@
es: Comprende los principios fundamentales de %@
fr: Comprendre les principes fondamentaux de %@

source: Apply techniques through practical coding exercises
es: Aplica técnicas a través de ejercicios prácticos de codificación
fr: Appliquer des techniques grâce à des exercices de codification pratiques

source: Build confidence with real-world scenario walkthroughs
es: Desarrolla confianza con recorridos de escenarios del mundo real
fr: Développez votre confiance avec des parcours de scénarios réels

source: Prepare for the next lesson in the learning path
es: Prepárate para la siguiente lección en la ruta de aprendizaje
fr: Préparez-vous pour la prochaine leçon du parcours
